uwrobotics/MarsRoverHardware/Projects/Robot Controller/Rev1/GimbDrive/GimbDrive.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Src
PH0-OSC_IN.Locked=true
PB13.GPIOParameters=GPIO_Label
PC7.GPIOParameters=GPIO_Label
PH0-OSC_IN.Signal=RCC_OSC_IN
USART2.IPParameters=VirtualMode
RCC.CortexFreq_Value=16000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F446RETx
RCC.PLLCLKFreq_Value=96000000
PB14.GPIO_Label=nPB_3
RCC.PLLQCLKFreq_Value=96000000
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_UART4_Init-UART4-false-HAL-true,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_ADC2_Init-ADC2-false-HAL-true,6-MX_USART1_UART_Init-USART1-false-HAL-true,7-MX_USART2_UART_Init-USART2-false-HAL-true,8-MX_USART6_UART_Init-USART6-false-HAL-true
PC0.GPIOParameters=GPIO_Label
PA9.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PC0.GPIO_Label=SLIDE_POT_AL
PC6.GPIO_Label=ARM_UART_TX
PC3.Locked=true
PA11.Mode=CTS_RTS
PA3.GPIOParameters=GPIO_Label
PA6.GPIO_Label=nSW_A
PB0.GPIO_Label=JOY_SM_Y
RCC.PLLI2SRCLKFreq_Value=96000000
USART1.IPParameters=VirtualMode
PC1.Locked=true
PB13.GPIO_Label=nPB_2
PB13.Signal=GPIO_Input
PB15.Signal=GPIO_Input
RCC.SAIAFreq_Value=96000000
PA2.GPIOParameters=GPIO_Label
PC15-OSC32_OUT.GPIO_Label=nJOY_BTN
PinOutPanel.RotationAngle=0
ProjectManager.StackSize=0x400
Mcu.IP4=SYS
Mcu.IP5=USART1
Mcu.IP2=NVIC
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=RCC
Mcu.IP0=ADC1
PA12.Locked=true
Mcu.IP1=ADC2
PA12.Signal=USART1_RTS
Mcu.UserConstants=
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
RCC.SDIOFreq_Value=96000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
PC7.Signal=USART6_RX
PC3.Signal=GPIO_Output
Mcu.Pin6=PC3
Mcu.Pin7=PA0-WKUP
Mcu.Pin8=PA1
Mcu.Pin9=PA2
RCC.VCOSAIOutputFreq_Value=192000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
PB13.Locked=true
Mcu.Pin0=PC15-OSC32_OUT
Mcu.Pin1=PH0-OSC_IN
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PH1-OSC_OUT
Mcu.Pin3=PC0
PA0-WKUP.GPIOParameters=GPIO_Label
Mcu.Pin4=PC1
Mcu.Pin5=PC2
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_10
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=JTAG_4_pins
PA15.Mode=JTAG_4_pins
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PB12.GPIO_Label=nPB_1
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.24.2
MxDb.Version=DB.5.0.50
PB0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=1000000
PA14.Mode=JTAG_4_pins
SH.ADCx_IN1.ConfNb=1
PB1.GPIO_Label=JOY_SM_X
File.Version=6
PA10.GPIO_Label=USB_USART_RX
SH.ADCx_IN8.0=ADC1_IN8,IN8
PH1-OSC_OUT.Locked=true
RCC.PLLRCLKFreq_Value=96000000
SH.ADCx_IN0.0=ADC1_IN0,IN0
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
PB0.Locked=true
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
ProjectManager.ProjectName=GimbDrive
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PC8.GPIOParameters=GPIO_Label
Mcu.Package=LQFP64
PB1.Signal=ADCx_IN9
PA6.Signal=GPIO_Input
PA7.Locked=true
PA5.Locked=true
USART2.VirtualMode=VM_ASYNC
USART6.VirtualMode=VM_ASYNC
PA14.Locked=true
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=SCI_UART_TX
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
PA15.Signal=SYS_JTDI
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_Label
SH.ADCx_IN9.0=ADC2_IN9,IN9
SH.ADCx_IN1.0=ADC1_IN1,IN1
ADC2.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
RCC.CECFreq_Value=32786.88524590164
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ADC2.Rank-2\#ChannelRegularConversion=1
SH.ADCx_IN9.ConfNb=1
PC15-OSC32_OUT.GPIOParameters=GPIO_Label
RCC.SAIBFreq_Value=96000000
PC2.GPIO_Label=LED_G
ProjectManager.CustomerFirmwarePackage=
RCC.PLLSAIQCLKFreq_Value=96000000
PB15.Locked=true
PB3.Locked=true
PA3.Signal=USART2_RX
PA6.GPIOParameters=GPIO_Label
ProjectManager.ProjectFileName=GimbDrive.ioc
ADC1.Rank-0\#ChannelRegularConversion=1
PA10.Mode=Asynchronous
Mcu.PinsNb=32
ProjectManager.NoMain=false
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag
USART6.IPParameters=VirtualMode
PA9.GPIO_Label=USB_USART_TX
RCC.VCOI2SInputFreq_Value=1000000
PC8.Signal=GPIO_Output
PC2.Signal=GPIO_Output
PC6.Signal=USART6_TX
PA11.GPIO_Label=USB_USART_CTS
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PC0.Signal=ADCx_IN10
PB14.Locked=true
PA12.GPIO_Label=USB_USART_RTS
RCC.FamilyName=M
PA0-WKUP.GPIO_Label=JOY_X
PA0-WKUP.Signal=ADCx_IN0
PA0-WKUP.Locked=true
PC3.GPIOParameters=GPIO_Label
PC8.GPIO_Label=nLED_ARM
PA3.Mode=Asynchronous
PA13.Signal=SYS_JTMS-SWDIO
PA15.Locked=true
PA11.Locked=true
PA9.Mode=Asynchronous
PC15-OSC32_OUT.Locked=true
ProjectManager.TargetToolchain=EWARM V8.32
PC6.Mode=Asynchronous
ADC2.IPParameters=Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,NbrOfConversionFlag
PA9.Signal=USART1_TX
PC2.Locked=true
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=96000000
PC15-OSC32_OUT.Signal=GPIO_Input
PA1.Signal=ADCx_IN1
PB1.Locked=true
RCC.VCOI2SOutputFreq_Value=192000000
PB14.Signal=GPIO_Input
PA5.Signal=GPIO_Output
RCC.PLLSAIPCLKFreq_Value=96000000
board=custom
RCC.VCOOutputFreq_Value=192000000
ProjectManager.LastFirmware=true
ADC2.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_9
MxCube.Version=5.5.0
PB15.GPIO_Label=nPB_4
RCC.PLLI2SPCLKFreq_Value=96000000
SH.ADCx_IN0.ConfNb=1
PC2.GPIOParameters=GPIO_Label
SH.ADCx_IN10.ConfNb=1
Mcu.Pin30=PB3
PA1.GPIO_Label=JOY_Y
PC1.GPIO_Label=LED_R
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin31=VP_SYS_VS_Systick
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.ADCx_IN8.ConfNb=1
PB15.GPIOParameters=GPIO_Label
PA13.Mode=JTAG_4_pins
ProjectManager.FreePins=false
RCC.IPParameters=CECFreq_Value,CortexFreq_Value,FamilyName,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLQCLKFreq_Value,PLLRCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,SAIAFreq_Value,SAIBFreq_Value,SDIOFreq_Value,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIInputFreq_Value,VCOSAIOutputFreq_Value
ProjectManager.AskForMigrate=false
Mcu.Name=STM32F446R(C-E)Tx
RCC.PLLI2SQCLKFreq_Value=96000000
Mcu.Pin26=PA12
Mcu.Pin27=PA13
PA2.Signal=USART2_TX
Mcu.Pin24=PA10
ProjectManager.UnderRoot=false
Mcu.Pin25=PA11
PC7.GPIO_Label=ARM_UART_RX
Mcu.Pin28=PA14
Mcu.IP6=USART2
Mcu.Pin29=PA15
RCC.VCOSAIInputFreq_Value=1000000
Mcu.IP7=USART6
ProjectManager.CoupleFile=false
PB3.Signal=SYS_JTDO-SWO
Mcu.Pin22=PC8
Mcu.Pin23=PA9
PA1.Locked=true
PA7.GPIO_Label=nSW_B
Mcu.Pin20=PC6
ADC1.master=1
Mcu.Pin21=PC7
PA12.Mode=CTS_RTS
PA5.GPIO_Label=nLED_SCI
PA10.Locked=true
ADC2.NbrOfConversionFlag=1
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Locked=true
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PA11.Signal=USART1_CTS
PA14.Signal=SYS_JTCK-SWCLK
SH.ADCx_IN10.0=ADC1_IN10,IN10
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB1
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB12
Mcu.Pin13=PA7
Mcu.Pin14=PB0
PC6.GPIOParameters=GPIO_Label
Mcu.Pin19=PB15
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB13
Mcu.Pin18=PB14
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA5
Mcu.Pin12=PA6
Mcu.Pin10=PA3
PA2.Mode=Asynchronous
PC3.GPIO_Label=LED_B
PC8.Locked=true
PC7.Mode=Asynchronous
PB0.Signal=ADCx_IN8
PA7.GPIOParameters=GPIO_Label
PC0.Locked=true
ProjectManager.DeviceId=STM32F446RETx
PC1.Signal=GPIO_Output
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Input
ProjectManager.LibraryCopy=0
PA3.GPIO_Label=SCI_UART_RX
PB1.GPIOParameters=GPIO_Label
PA7.Signal=GPIO_Input
PA6.Locked=true
